In [11]:
import mysql.connector as sql
import pandas as pd

mydb = sql.connect(
    host = "localhost",
    user="root",
    password="19821205",
    auth_plugin="mysql_native_password",
    #buffered = True,
    database="sql_fr_ai"
)

sql_query = """
select count(*)
from (
            SELECT 
                        *
            FROM
                        order_report_1

            UNION

                            SELECT
                                        *
                            FROM
                                        order_report_2
) as order_report

"""

df = pd.read_sql_query(
    sql_query,
    mydb
)
#80078
#22677
df

C:\Users\Bruce Ashbee\AppData\Local\Temp\ipykernel_16116\1036072162.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(

   count(*)
0    102755

In [16]:
import mysql.connector as sql
import pandas as pd

mydb_3 = sql.connect(
    host = "localhost",
    user = "root",
    password = "19821205",
    auth_plugin = "mysql_native_password",
    database = "sql_fr_ai"
)

sql_query = """
select * from order_report_1
limit 29
"""
content  = pd.read_sql_query(
    sql_query,
    mydb
)

content

C:\Users\Bruce Ashbee\AppData\Local\Temp\ipykernel_16116\2396146073.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  content  = pd.read_sql_query(

           order_id    date_ymd taste  amount
0   2016-04-05-0083  2016-04-05    T1   800.0
1   2016-04-05-0028  2016-04-05    T1   800.0
2   2016-04-05-0049  2016-04-05    T1   800.0
3   2016-04-05-0035  2016-04-05    T2   850.0
4   2016-04-05-0016  2016-04-05    T2   850.0
5   2016-04-05-0069  2016-04-05    T2   850.0
6   2016-04-05-0031  2016-04-05    T2   850.0
7   2016-04-05-0012  2016-04-05    T2   850.0
8   2016-04-05-0038  2016-04-05    T2   850.0
9   2016-04-05-0059  2016-04-05    T2   850.0
10  2016-04-05-0062  2016-04-05    T2   850.0
11  2016-04-05-0047  2016-04-05    T2   850.0
12  2016-04-05-0058  2016-04-05    T2   850.0
13  2016-04-05-0009  2016-04-05    T2   850.0
14  2016-04-05-0005  2016-04-05    T2   850.0
15  2016-04-05-0021  2016-04-05    T2   850.0
16  2016-04-05-0023  2016-04-05    T2   850.0
17  2016-04-05-0002  2016-04-05    T2   850.0
18  2016-04-05-0033  2016-04-05    T2   850.0
19  2016-04-05-0039  2016-04-05    T2   850.0
20  2016-04-05-0067  2016-04-05    T2   850.0
21  2016-04-05-0048  2016-04-05    T2   850.0
22  2016-04-05-0022  2016-04-05    T2   850.0
23  2016-04-05-0074  2016-04-05    T2   850.0
24  2016-04-05-0018  2016-04-05    T2   850.0
25  2016-04-05-0079  2016-04-05    T2   850.0
26  2016-04-05-0070  2016-04-05    T2   850.0
27  2016-04-05-0061  2016-04-05    T2   850.0
28  2016-04-05-0014  2016-04-05    T2   850.0

In [17]:
import pandas as pd
import mysql.connector as sql

mydb = sql.connect(
    host = "localhost",
    user = "root",
    password = "19821205",
    auth_plugin = "mysql_native_password",
    buffered = True,
    database = "sql_fr_ai"
)

sql_query = """
select 
            date_ymd,
            taste,
            sum(amount) AS amount_day
from 
            order_report_1
group by
            date_ymd,
            taste
"""

table_content = pd.read_sql_query(
    sql_query,
    mydb
)

table_content

C:\Users\Bruce Ashbee\AppData\Local\Temp\ipykernel_16116\4187201967.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_content = pd.read_sql_query(

        date_ymd taste    Total
0     2016-04-05    T1   2400.0
1     2016-04-05    T2  34000.0
2     2016-04-05    T3  12000.0
3     2016-04-05    T4   1500.0
4     2016-04-05    T5  18000.0
...          ...   ...      ...
1245  2016-04-04    T3  24800.0
1246  2016-04-04    T4   4500.0
1247  2016-04-04    T5   4000.0
1248  2016-04-04    T6   5400.0
1249  2016-04-04    T7   4250.0

[1250 rows x 3 columns]

In [25]:
import mysql.connector as sql_connector
import pandas as pd

mydatabase = sql_connector.connect(
    host = "localhost",
    user = "root",
    password = "19821205",
    auth_plugin = "mysql_native_password",
    buffered = True,
    database = "sql_fr_ai"
)

sql_query = """
select 
        daily_order.date_ymd,
        SUM( daily_order.amount ) AS daily_amount
from (
        select * from order_report_1
        union all
        select * from order_report_2
) as daily_order

group by
            daily_order.date_ymd
"""

table_content = pd.read_sql_query(
    sql_query,
    mydatabase
)

table_content

C:\Users\Bruce Ashbee\AppData\Local\Temp\ipykernel_16116\3656223011.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_content = pd.read_sql_query(

       date_ymd  daily_amount
0    2016-04-05       74950.0
1    2016-04-06      145550.0
2    2016-04-07       95900.0
3    2016-04-08      160400.0
4    2016-04-09      170550.0
..          ...           ...
360  2016-12-12       69400.0
361  2016-12-13       65400.0
362  2016-12-14       56300.0
363  2016-12-15       61500.0
364  2016-12-16       47650.0

[365 rows x 2 columns]

In [35]:
import mysql.connector as my_sql_connector
import pandas as pd

mydb = my_sql_connector.connect(
    host = "localhost",
    user = "root",
    password = "19821205",
    auth_plugin = "mysql_native_password",
    buffered = True,
    database = "sql_fr_ai"
)

sql_query = """
SELECT
            order_report.date_ymd,
            order_report.taste,
            sum( order_report.amount ) AS daily_sales
FROM (
        SELECT * FROM order_report_1
        UNION ALL
        SELECT * FROM order_report_2
) AS order_report
group by
        order_report.date_ymd,
        order_report.taste


"""

content_in_pd = pd.read_sql_query(
    sql_query,
    mydb
)

content_in_pd

C:\Users\Bruce Ashbee\AppData\Local\Temp\ipykernel_16116\87973113.py:43: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  content_in_pd = pd.read_sql_query(

        date_ymd taste  daily_sales
0     2016-04-05    T1       2400.0
1     2016-04-05    T2      34000.0
2     2016-04-05    T3      12000.0
3     2016-04-05    T4       1500.0
4     2016-04-05    T5      18000.0
...          ...   ...          ...
2413  2016-12-16    T3       1600.0
2414  2016-12-16    T4       3000.0
2415  2016-12-16    T5       4000.0
2416  2016-12-16    T6       1800.0
2417  2016-12-16    T7       4250.0

[2418 rows x 3 columns]

In [40]:
import mysql.connector as mysql_connector
import pandas as pd

mydb = mysql_connector.connect(
    host="localhost",
    user = "root",
    password = "19821205",
    auth_plugin = "mysql_native_password",
    buffered = True,
    database = "sql_fr_ai"
)

sql_query = """
SELECT 
            order_report.date_ymd,
            SUM( order_report.amount ) AS daily_amount
FROM (
            SELECT * FROM order_report_1
            UNION ALL
            SELECT * FROM order_report_2
) AS order_report

GROUP BY
            order_report.date_ymd
ORDER BY
            daily_amount DESC

"""

content_in_pandas = pd.read_sql_query(
    sql_query,
    mydb
)

content_in_pandas

C:\Users\Bruce Ashbee\AppData\Local\Temp\ipykernel_16116\3524436725.py:30: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  content_in_pandas = pd.read_sql_query(

       date_ymd  daily_amount
0    2016-08-09      618200.0
1    2016-08-07      618050.0
2    2016-06-18      617450.0
3    2016-09-10      617050.0
4    2016-09-25      615550.0
..          ...           ...
360  2017-01-24       24850.0
361  2017-01-14       23450.0
362  2016-11-24       18900.0
363  2017-02-09       16500.0
364  2017-01-15        6800.0

[365 rows x 2 columns]